import { useState } from 'react'
import styles from './ScrollToTopButton.module.scss' // Модульные стили

export const ScrollToTopButton = () => {
  // Плавная прокрутка вверх
  const scrollToTop = () => {
    window.scrollTo({
      top: 0,
      behavior: 'smooth',
    })
  }

  return (
    <button className={styles.button} onClick={scrollToTop} aria-label="Вернуться к началу страницы">
      <svg className={styles.iconDefault} width="60" height="60" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg">
        <rect width="60" height="60" rx="30" fill="#CFE2FF" />
        <path
          d="M40.1159 27.2004C39.7992 27.2004 39.4826 27.0837 39.2326 26.8337L29.9992 17.6004L20.7659 26.8337C20.2826 27.3171 19.4826 27.3171 18.9992 26.8337C18.5159 26.3504 18.5159 25.5504 18.9992 25.0671L29.1159 14.9504C29.5992 14.4671 30.3992 14.4671 30.8826 14.9504L40.9992 25.0671C41.4826 25.5504 41.4826 26.3504 40.9992 26.8337C40.7659 27.0837 40.4326 27.2004 40.1159 27.2004Z"
          fill="#332F36"
        />
        <path
          d="M30 45.4172C29.3167 45.4172 28.75 44.8505 28.75 44.1672V16.1172C28.75 15.4339 29.3167 14.8672 30 14.8672C30.6833 14.8672 31.25 15.4339 31.25 16.1172V44.1672C31.25 44.8505 30.6833 45.4172 30 45.4172Z"
          fill="#332F36"
        />
      </svg>

      <svg className={styles.iconHover} width="60" height="60" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg">
        <rect width="60" height="60" rx="30" fill="#357EEB" />
        <path
          d="M40.1159 27.2004C39.7992 27.2004 39.4826 27.0837 39.2326 26.8337L29.9992 17.6004L20.7659 26.8337C20.2826 27.3171 19.4826 27.3171 18.9992 26.8337C18.5159 26.3504 18.5159 25.5504 18.9992 25.0671L29.1159 14.9504C29.5992 14.4671 30.3992 14.4671 30.8826 14.9504L40.9992 25.0671C41.4826 25.5504 41.4826 26.3504 40.9992 26.8337C40.7659 27.0837 40.4326 27.2004 40.1159 27.2004Z"
          fill="white"
        />
        <path
          d="M30 45.4172C29.3167 45.4172 28.75 44.8505 28.75 44.1672V16.1172C28.75 15.4339 29.3167 14.8672 30 14.8672C30.6833 14.8672 31.25 15.4339 31.25 16.1172V44.1672C31.25 44.8505 30.6833 45.4172 30 45.4172Z"
          fill="white"
        />
      </svg>
    </button>
  )
}
