export const notifications = [
  {
    id: 1,
    info: 'Уведомлять о присланных домашних заданиях',
    desc: ' После каждой присланной домашней работы вам будет приходить уведомление на почту',
  },
  {
    id: 2,
    info: 'Уведомлять о непрочитанных сообщениях',
    desc: 'Раз в сутки вам на почту будет приходить уведомление, если у вас есть непрочитанные сообщения',
  },
  {
    id: 3,
    info: 'Уведомлять о предстоящем вебинаре',
    desc: 'Вы будете уведомлены перед началом вебинара, в котором вы указаны ответственным сотрудником',
  },
  {
    id: 4,
    info: 'Уведомлять о пройденных учениками курсах',
    desc: 'На почту придет уведомление, когда один из учеников пройдет все занятия курса',
  },
]
